Составить программу:Составить программу:
 а) вычисления значения функции y=7x2+3x+6 при любом значении x;
 б) вычисления значения функции x=12a2+7a+12 при любом значении а.
 а) вычисления значения функции y=7x2+3x+6 при любом значении x;
 б) вычисления значения функции x=12a2+7a+12 при любом значении а.
Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());

int x = 12 * a * 2 + 7 * a + 12
int y = 7 * x * 3 * 3 * x * 6
Console.WriteLine(x+""+y)


Известны количество жителей в государстве и площадь его территории. Определить плотность населения в этом государстве.
Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(x+""+y)

Известна стоимость 1 кг конфет, печенья и яблок. Найти стоимость всей покупки, если купили x кг конфет, у кг печенья и z кг яблок.
Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(x+""+y)
Console.WriteLine("Введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(x+""+y)

/*
Известна стоимость 1 кг конфет, печенья и яблок. Найти стоимость всей покупки, если купили x кг конфет, у кг печенья и z кг яблок.

Известна стоимость монитора, системного блока, клавиатуры и мыши. Сколько будут стоить 3 компьютера из этих элементов? N компьютеров?

Возраст Тани — X лет, а возраст Мити — Y лет. Найти их средний возраст, а также определить, на сколько отличается возраст каждого ребенка от среднего значения.

Два автомобиля едут навстречу друг другу с постоянными скоростями V1 и  V2 км/час. Определить, через какое время автомобили встретятся, если расстояние между ними было S км.

Известно значение температуры по шкале Цельсия. Найти соответствующее  значение температуры по шкале: 
а) Фаренгейта; 
б) Кельвина.
Для пересчета по шкале Фаренгейта необходимо исходное значение температуры умножить на 1,8 и к результату прибавить 32, 
а по шкале Кельвина абсолютное значение нуля соответствует 273,15 градуса по шкале Цельсия.
У американского писателя-фантаста Рэя Бредбери есть роман «450 градусов  по Фаренгейту».
Какой температуре по шкале Цельсия соответствует указанное в названии значение? 

Составить программу обмена значениями двух переменных величин.

Cоставить программу обмена значениями трех переменных величин а, b, c по
следующим двум схемам: 
    а) b присвоить значение c, а присвоить значение b, с присвоить значение а;
    б) b присвоить значение а, с присвоить значение b, а присвоить значение с.

Дано вещественное число а. Пользуясь только операцией умножения, получить:
а) a4 за две операции;
б) a6  за три операции;
в) a7 за четыре операции;
г) a8  за три операции;
д) a9 за четыре операции;
е) a10  за четыре операции.

Дано расстояние в сантиметрах. Найти число полных метров в нем.

С некоторого момента прошло 234 дня. Сколько полных недель прошло за этот период?

Дано двузначное число. Найти:
а) число десятков в нем;
б) число единиц в нем;
в) сумму его цифр;
г) произведение его цифр.
i.t.girl — 29.06.2023 15:35
Новые задачи
написать метод заполнения массива рандомными цифрами от 10 до 99 (этот метод нам дальше будет нужен везде, так что делаем красивый. чтобы цифры через ",",
по желанию можно выделять цветом (не забываем только что цвет надо включить а потом выключить), чтобы в начале и в конце массива были "[]")
Известны два расстояния: одно в километрах, другое — в футах (1 фут 0,305 м). Какое из расстояний меньше?
Известны год и номер месяца рождения человека, а также год и номер месяца сегодняшнего дня (январь — 1 и т. д.).
Определить возраст человека (число полных лет). В случае совпадения указанных номеров месяцев считать, что прошел полный год.
Даны радиус круга и сторона квадрата. У какой фигуры площадь больше?
Дано трехзначное число. Определить:
а) является ли сумма его цифр двузначным числом;
б) является ли произведение его цифр трехзначным числом;
в) больше ли числа а произведение его цифр;
г) кратна ли пяти сумма его цифр;
д) кратна ли сумма его цифр числу а.
Работа светофора для пешеходов запрограммирована следующим образом: в начале каждого часа в течение трех минут горит зеленый сигнал,
затем в течение двух минут — красный, в течение трех минут — опять зеленый и т. д. Дано вещественное число t, означающее время в минутах, 
прошедшее с начала очередного часа. Определить, сигнал какого цвета горит для пешеходов в этот момент.
Проверить, принадлежит ли число, введенное с клавиатуры, интервалу (–5, 3).
Вася пытается высунуть голову в форточку размерами a и b см. Приняв условно, что его голова — круглая диаметром d см,
определить, сможет ли Вася сделать это. Для прохождения головы в форточку необходим зазор в 1 см с каждой стороны.
Пассажир должен был сдать в камеру хранения пустой чемодан в форме параллелепипеда размерами a1 , a2 и a3 см и
коробку размерами b1 , b2 и b3 см. Оплачивать нужно каждый размещаемый предмет. Определить, сможет ли пассажир сэкономить на оплате, 
поместив коробку в чемодан так, что стороны чемодана и коробки будут параллельны либо перпендикулярны друг другу.
Дано натуральное число n (n <= 9999). Выяснить, верно ли, что это число содержит ровно три одинаковые цифры с учетом четырех цифр,
как, например, числа 3363, 4844, 0300 и т. п.
Даны три вещественных числа. Вывести на экран:
а) те из них, которые принадлежат интервалу (1,6—3,8);
б) те из них, которые принадлежат интервалу (0,7—5,1).
Даны четыре целых числа. Определить, сколько из них четных.
В чемпионате по футболу команде за выигрыш дается 3 очка, за проигрыш — 0, за ничью — 1. Известно количество очков, полученных командой за игру.
Определить словесный результат игры (выигрыш, проигрыш или ничья).
Известен вес самбиста-любителя. Известно, что вес таков, что самбист может быть отнесен к одной из трех весовых категорий:
1) легкий вес — до 60 кг;
2) первый полусредний вес — до 64 кг;
3) полусредний вес — до 69 кг.
Определить, в какой категории будет выступать данный боксер.
Мастям игральных карт условно присвоены следующие порядковые номера: масти «пики» — 1, масти «трефы» — 2, масти «бубны» — 3,
масти «червы» — 4, а достоинству карт: «валету» — 11, «даме» — 12, «королю» — 13, «тузу» — 14 
(порядковые номера карт остальных достоинств соответствуют их названиям: «шестерка», «девятка» и т. п.). 
По заданным номеру масти m (1 <= m <= 4) и номеру достоинства карты k (6 <= k <= 14) определить полное название 
(масть и достоинство) соответствующей карты в виде «Дама пик», Шестерка бубен» и т. п.
Дата некоторого дня характеризуется двумя натуральными числами: m (порядковый номер месяца) и n (число). По заданным n и m определить:
а) дату предыдущего дня (принять, что n и m не характеризуют 1 января);
б) дату следующего дня (принять, что n и m не характеризуют 31 декабря).
Примечание. В обеих задачах принять, что год не является високосным.
В некоторых странах Дальнего Востока (Китае, Японии и др.) использовался (и неофициально используется в настоящее время) календарь,
отличающийся от применяемого нами. Этот календарь представляет собой 60-летнюю циклическую систему. 
Каждый 60-летний цикл состоит из пяти 12-летних подциклов. В каждом подцикле года носят названия животных: 
Крыса, Корова, Тигр, Заяц, Дракон, Змея, Лошадь, Овца, Обезьяна, Петух, Собака и Свинья. 
Кроме того, в названии года фигурируют цвета животных, которые связаны с пятью элементами природы — Деревом (зеленый), 
Огнем (красный), Землей (желтый), Металлом (белый) и Водой (черный). В результате  каждое животное (и его год) имеет символический цвет, 
причем цвет этот часто совершенно не совпадает с его «естественной» окраской — Тигр может быть черным, Свинья — красной, а Лошадь — зеленой. 
Например, 1984 год — год начала очередного цикла — назывался годом Зеленой Крысы. Каждый цвет в цикле (начиная с зеленого) «действует» два года, 
поэтому через каждые 60 лет имя года (животное и его цвет) повторяется. Составить программу, которая по заданному номеру года нашей эры n печатает 
его название по описанному календарю в виде: «Крыса, Зеленый». Рассмотреть два случая:
а) значение n >= 1984;
б) значение n может быть любым натуральным числом.
Для натурального числа k напечатать фразу «мы нашли k грибов в лесу», согласовав окончание слова «гриб» с числом k.
19.Даны цифры двух целых чисел: двузначного a2a1 и однозначного b, где a1 — число единиц, a2 — число десятков. 
Получить цифры числа, равного разности заданных чисел (известно, что это число двузначное). Число-уменьшаемое и число-разность не определять.
Даны цифры двух двузначных чисел, записываемых в виде a2a1 и b2b1 , где a1 и b1 — число единиц, a2 и b2 — число десятков.
Получить цифры числа, равного разности заданных чисел (известно, что это число двузначное). 
Число-уменьшаемое, число-вычитаемое и число-разность не определять.
Даны цифры двух десятичных целых чисел: трехзначного a3a2a1 и двузначного b2b1, где a1 и b1 — число единиц,
a2 и b2 — число десятков, a3 — число сотен. Получить цифры, составляющие разность этих чисел (известно, что это число трехзначное). 
Число-уменьшаемое, число-вычитаемое и число-разность не определять.
Поле шахматной доски определяется парой натуральных чисел, каждое из которых не превосходит 8: первое число — номер вертикали (при счете слева направо), второе — номер горизонтали (при счете снизу вверх). Даны натуральные числа a, b, c, d, каждое из которых не превосходит 8.
а) на поле (a, b) расположена ладья. Определить, угрожает ли она полю (c, d);
б) на поле (a, b) расположен слон. Определить, угрожает ли он полю (c, d);
в) на поле (a, b) расположен король. Определить, может ли он одним ходом попасть на поле (c, d);
г) на поле (a, b) расположен ферзь. Определить, угрожает ли он полю (c, d);
д) на поле (a, b) расположена белая пешка. Определить, может ли она одним ходом попасть на поле (c, d):
— при обычном ходе;
— когда она «бьет» фигуру или пешку соперника;
Примечание. Белые пешки перемещаются на доске снизу вверх.
е) на поле (a, b) расположена черная пешка. Определить, может ли она одним ходом попасть на поле (c, d):
— при обычном ходе;
— когда она «бьет» фигуру или пешку соперника;
Примечание. Черные пешки перемещаются на доске сверху вниз.
ж) на поле (a, b) расположен конь. Определить, угрожает ли он полю (c, d).
Во всех задачах ответ проверить на шахматной доске или на клетчатой бумаге.
i.t.girl — 15.08.2023 10:05
Задан одномерный массив целых чисел. Образуйте из него два отсортированных по возрастанию массива, содержащих четные и нечетные числа. Подсказка: четное число делится на 2 без остатка.
Задан генератором случайных чисел одномерный массив из действительных чисел. Найдите максимальное и минимальное число этого массива.
В одномерном массиве из 100 чисел M[] подсчитайте количество элементов, удовлетворяющих условию 0 < M[i] <125.
Задан массив действительных чисел из N элементов (используйте генератор случайных чисел). Определить количество элементов, значения которых находятся в диапазоне от -100 до +100.
Задан массив действительных чисел из N элементов (используйте генератор случайных чисел). Определить количество элементов, значения которых находятся вне диапазона от -10 до +10.
В заданном массиве действительных чисел найдите разность между максимальным и минимальным числом.
Напишите методы для ввода одномерного массива с клавиатуры и для вывода его содержимого на экран.
Сформируйте массив целых чисел по алгоритму Фибоначчи: 1-й и 2-й элемент равны 1, а каждый последующий равен сумме двух предыдущих, т.е.: 1, 1, 2, 3, 5, 8, … . Найдите сумму и произведение его N членов.
Сформируйте одномерный массив действительных чисел как геометрическую последовательность со знаменателем ½, начиная с 1, т.е.: 1,0 0,5 0,25 0,125 и т.д.
Задан массив целых чисел A[20]. Создать другой массив целых чисел B[ ], в который войдут все числа исходного массива, удовлетворяющие условию: А[i] <= 888, после чего отсортировать элементы массива В[ ] по убыванию.
Задача 3. В заданной строке текста определите количество слов. Каждое слово отделено друг от друга пробелом.
Введите с клавиатуры строку произвольной длины и подсчитайте вхождения заданного символа в строку.
Определите, присутствует ли в тексте, заданном в виде строки, некоторое слово (различие регистра игнорируйте).
В массиве строк (список фамилий) определите самую длинную фамилию.
Отсортируйте введенный список фамилий по алфавиту и выведите его на экран.
*/

